grevaillot/svd_tools/headers/STM32H7A3x/adc1.h
/** @defgroup adc1_jdr2 JDR2 ADC group injected sequencer rank 2 register
@{*/


#define ADC1_JDR2_JDATA2_SHIFT		0
#define ADC1_JDR2_JDATA2_MASK		0xffffffff
/** @defgroup adc1_jdr2_jdata2 JDATA2 ADC group injected sequencer rank 2 conversion data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_jdr3 JDR3 ADC group injected sequencer rank 3 register
@{*/


#define ADC1_JDR3_JDATA3_SHIFT		0
#define ADC1_JDR3_JDATA3_MASK		0xffffffff
/** @defgroup adc1_jdr3_jdata3 JDATA3 ADC group injected sequencer rank 3 conversion data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_jdr4 JDR4 ADC group injected sequencer rank 4 register
@{*/


#define ADC1_JDR4_JDATA4_SHIFT		0
#define ADC1_JDR4_JDATA4_MASK		0xffffffff
/** @defgroup adc1_jdr4_jdata4 JDATA4 ADC group injected sequencer rank 4 conversion data
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_awd2cr AWD2CR ADC analog watchdog 2 configuration register
@{*/


#define ADC1_AWD2CR_AWD2CH_SHIFT		0
#define ADC1_AWD2CR_AWD2CH_MASK		0xfffff
/** @defgroup adc1_awd2cr_awd2ch AWD2CH ADC analog watchdog 2 monitored channel selection
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_awd3cr AWD3CR ADC analog watchdog 3 configuration register
@{*/


#define ADC1_AWD3CR_AWD3CH_SHIFT		1
#define ADC1_AWD3CR_AWD3CH_MASK		0xfffff
/** @defgroup adc1_awd3cr_awd3ch AWD3CH ADC analog watchdog 3 monitored channel selection
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_ltr2 LTR2 ADC watchdog lower threshold register 2
@{*/


#define ADC1_LTR2_LTR2_SHIFT		0
#define ADC1_LTR2_LTR2_MASK		0x3ffffff
/** @defgroup adc1_ltr2_ltr2 LTR2 Analog watchdog 2 lower threshold
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_htr2 HTR2 ADC watchdog higher threshold register 2
@{*/


#define ADC1_HTR2_HTR2_SHIFT		0
#define ADC1_HTR2_HTR2_MASK		0x3ffffff
/** @defgroup adc1_htr2_htr2 HTR2 Analog watchdog 2 higher threshold
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_ltr3 LTR3 ADC watchdog lower threshold register 3
@{*/


#define ADC1_LTR3_LTR3_SHIFT		0
#define ADC1_LTR3_LTR3_MASK		0x3ffffff
/** @defgroup adc1_ltr3_ltr3 LTR3 Analog watchdog 3 lower threshold
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_htr3 HTR3 ADC watchdog higher threshold register 3
@{*/


#define ADC1_HTR3_HTR3_SHIFT		0
#define ADC1_HTR3_HTR3_MASK		0x3ffffff
/** @defgroup adc1_htr3_htr3 HTR3 Analog watchdog 3 higher threshold
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_difsel DIFSEL ADC channel differential or single-ended mode selection register
@{*/


#define ADC1_DIFSEL_DIFSEL_SHIFT		0
#define ADC1_DIFSEL_DIFSEL_MASK		0xfffff
/** @defgroup adc1_difsel_difsel DIFSEL ADC channel differential or single-ended mode for channel
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_calfact CALFACT ADC calibration factors register
@{*/


#define ADC1_CALFACT_CALFACT_D_SHIFT		16
#define ADC1_CALFACT_CALFACT_D_MASK		0x7ff
/** @defgroup adc1_calfact_calfact_d CALFACTD ADC calibration factor in differential mode
@{*/
/**@}*/


#define ADC1_CALFACT_CALFACT_S_SHIFT		0
#define ADC1_CALFACT_CALFACT_S_MASK		0x7ff
/** @defgroup adc1_calfact_calfact_s CALFACTS ADC calibration factor in single-ended mode
@{*/
/**@}*/


/**@}*/

/** @defgroup adc1_calfact2 CALFACT2 ADC Calibration Factor register 2
@{*/


#define ADC1_CALFACT2_LINCALFACT_SHIFT		0
#define ADC1_CALFACT2_LINCALFACT_MASK		0x3fffffff
/** @defgroup adc1_calfact2_lincalfact LINCALFACT Linearity Calibration Factor
@{*/
/**@}*/


/**@}*/
